cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xT.svd
        <!-- REGISTER "ICU_ICFS32" -->
        <register derivedFrom="ICU_ICFS10">
          <name>ICU_ICFS32</name>
          <description> register ICU_ICFS32 </description>
          <addressOffset>0x61</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSA10" -->
        <register>
          <name>ICU_ICSA10</name>
          <description> register ICU_ICSA10 </description>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EG0" -->
            <field>
              <name>EG0</name>
              <description> bitfield EG0 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EG1" -->
            <field>
              <name>EG1</name>
              <description> bitfield EG1 </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE0" -->
            <field>
              <name>ICE0</name>
              <description> bitfield ICE0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICE1" -->
            <field>
              <name>ICE1</name>
              <description> bitfield ICE1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP0" -->
            <field>
              <name>ICP0</name>
              <description> bitfield ICP0 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICP1" -->
            <field>
              <name>ICP1</name>
              <description> bitfield ICP1 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSA32" -->
        <register derivedFrom="ICU_ICSA10">
          <name>ICU_ICSA32</name>
          <description> register ICU_ICSA32 </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICSB10" -->
        <register>
          <name>ICU_ICSB10</name>
          <description> register ICU_ICSB10 </description>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IEI0" -->
            <field>
              <name>IEI0</name>
              <description> bitfield IEI0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IEI1" -->
            <field>
              <name>IEI1</name>
              <description> bitfield IEI1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICSB32" -->
        <register derivedFrom="ICU_ICSB10">
          <name>ICU_ICSB32</name>
          <description> register ICU_ICSB32 </description>
          <addressOffset>0x7D</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP0" -->
        <register>
          <name>ICU_ICCP0</name>
          <description> register ICU_ICCP0 </description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "ICU_ICCP1" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP1</name>
          <description> register ICU_ICCP1 </description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP2" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP2</name>
          <description> register ICU_ICCP2 </description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ICU_ICCP3" -->
        <register derivedFrom="ICU_ICCP0">
          <name>ICU_ICCP3</name>
          <description> register ICU_ICCP3 </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSA" -->
        <register>
          <name>ADCMP_ACSA</name>
          <description> register ADCMP_ACSA </description>
          <addressOffset>0xBC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CE0" -->
            <field>
              <name>CE0</name>
              <description> bitfield CE0 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE1" -->
            <field>
              <name>CE1</name>
              <description> bitfield CE1 </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE2" -->
            <field>
              <name>CE2</name>
              <description> bitfield CE2 </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL0" -->
            <field>
              <name>SEL0</name>
              <description> bitfield SEL0 </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL1" -->
            <field>
              <name>SEL1</name>
              <description> bitfield SEL1 </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL2" -->
            <field>
              <name>SEL2</name>
              <description> bitfield SEL2 </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSB" -->
        <register>
          <name>ADCMP_ACSB</name>
          <description> register ADCMP_ACSB </description>
          <addressOffset>0xB8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x77</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BDIS0" -->
            <field>
              <name>BDIS0</name>
              <description> bitfield BDIS0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS1" -->
            <field>
              <name>BDIS1</name>
              <description> bitfield BDIS1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS2" -->
            <field>
              <name>BDIS2</name>
              <description> bitfield BDIS2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS0" -->
            <field>
              <name>BTS0</name>
              <description> bitfield BTS0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS1" -->
            <field>
              <name>BTS1</name>
              <description> bitfield BTS1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS2" -->
            <field>
              <name>BTS2</name>
              <description> bitfield BTS2 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
