cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xT.svd
        <!-- REGISTER "EICL" -->
        <register>
          <name>EICL</name>
          <description> register EICL </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECL31" -->
            <field>
              <name>ECL31</name>
              <description> bitfield ECL31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL30" -->
            <field>
              <name>ECL30</name>
              <description> bitfield ECL30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL29" -->
            <field>
              <name>ECL29</name>
              <description> bitfield ECL29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL28" -->
            <field>
              <name>ECL28</name>
              <description> bitfield ECL28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL27" -->
            <field>
              <name>ECL27</name>
              <description> bitfield ECL27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL26" -->
            <field>
              <name>ECL26</name>
              <description> bitfield ECL26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL25" -->
            <field>
              <name>ECL25</name>
              <description> bitfield ECL25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL24" -->
            <field>
              <name>ECL24</name>
              <description> bitfield ECL24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL23" -->
            <field>
              <name>ECL23</name>
              <description> bitfield ECL23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL22" -->
            <field>
              <name>ECL22</name>
              <description> bitfield ECL22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL21" -->
            <field>
              <name>ECL21</name>
              <description> bitfield ECL21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL20" -->
            <field>
              <name>ECL20</name>
              <description> bitfield ECL20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL19" -->
            <field>
              <name>ECL19</name>
              <description> bitfield ECL19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL18" -->
            <field>
              <name>ECL18</name>
              <description> bitfield ECL18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL17" -->
            <field>
              <name>ECL17</name>
              <description> bitfield ECL17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL16" -->
            <field>
              <name>ECL16</name>
              <description> bitfield ECL16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL15" -->
            <field>
              <name>ECL15</name>
              <description> bitfield ECL15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL14" -->
            <field>
              <name>ECL14</name>
              <description> bitfield ECL14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL13" -->
            <field>
              <name>ECL13</name>
              <description> bitfield ECL13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL12" -->
            <field>
              <name>ECL12</name>
              <description> bitfield ECL12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL11" -->
            <field>
              <name>ECL11</name>
              <description> bitfield ECL11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL10" -->
            <field>
              <name>ECL10</name>
              <description> bitfield ECL10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL9" -->
            <field>
              <name>ECL9</name>
              <description> bitfield ECL9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL8" -->
            <field>
              <name>ECL8</name>
              <description> bitfield ECL8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL7" -->
            <field>
              <name>ECL7</name>
              <description> bitfield ECL7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL6" -->
            <field>
              <name>ECL6</name>
              <description> bitfield ECL6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL5" -->
            <field>
              <name>ECL5</name>
              <description> bitfield ECL5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL4" -->
            <field>
              <name>ECL4</name>
              <description> bitfield ECL4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL3" -->
            <field>
              <name>ECL3</name>
              <description> bitfield ECL3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL2" -->
            <field>
              <name>ECL2</name>
              <description> bitfield ECL2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL1" -->
            <field>
              <name>ECL1</name>
              <description> bitfield ECL1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL0" -->
            <field>
              <name>ECL0</name>
              <description> bitfield ECL0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
