cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xT.svd
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description> register EPFR16 </description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK11B" -->
            <field>
              <name>SCK11B</name>
              <description> bitfield SCK11B </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT11B" -->
            <field>
              <name>SOT11B</name>
              <description> bitfield SOT11B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN11S" -->
            <field>
              <name>SIN11S</name>
              <description> bitfield SIN11S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK10B" -->
            <field>
              <name>SCK10B</name>
              <description> bitfield SCK10B </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT10B" -->
            <field>
              <name>SOT10B</name>
              <description> bitfield SOT10B </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN10S" -->
            <field>
              <name>SIN10S</name>
              <description> bitfield SIN10S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK9B" -->
            <field>
              <name>SCK9B</name>
              <description> bitfield SCK9B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT9B" -->
            <field>
              <name>SOT9B</name>
              <description> bitfield SOT9B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN9S" -->
            <field>
              <name>SIN9S</name>
              <description> bitfield SIN9S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK8B" -->
            <field>
              <name>SCK8B</name>
              <description> bitfield SCK8B </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT8B" -->
            <field>
              <name>SOT8B</name>
              <description> bitfield SOT8B </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN8S" -->
            <field>
              <name>SIN8S</name>
              <description> bitfield SIN8S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description> register EPFR17 </description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK15B" -->
            <field>
              <name>SCK15B</name>
              <description> bitfield SCK15B </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT15B" -->
            <field>
              <name>SOT15B</name>
              <description> bitfield SOT15B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN15S" -->
            <field>
              <name>SIN15S</name>
              <description> bitfield SIN15S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK14B" -->
            <field>
              <name>SCK14B</name>
              <description> bitfield SCK14B </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT14B" -->
            <field>
              <name>SOT14B</name>
              <description> bitfield SOT14B </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN14S" -->
            <field>
              <name>SIN14S</name>
              <description> bitfield SIN14S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK13B" -->
            <field>
              <name>SCK13B</name>
              <description> bitfield SCK13B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT13B" -->
            <field>
              <name>SOT13B</name>
              <description> bitfield SOT13B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN13S" -->
            <field>
              <name>SIN13S</name>
              <description> bitfield SIN13S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK12B" -->
            <field>
              <name>SCK12B</name>
              <description> bitfield SCK12B </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT12B" -->
            <field>
              <name>SOT12B</name>
              <description> bitfield SOT12B </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN12S" -->
            <field>
              <name>SIN12S</name>
              <description> bitfield SIN12S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
