cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xT.svd
        <!-- REGISTER "LIN_TDR" -->
        <register>
          <name>LIN_TDR</name>
          <description> register LIN_TDR </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x00FF</resetValue>
          <resetMask>0x00FF</resetMask>
        </register>
        <!-- REGISTER "LIN_BGR" -->
        <register>
          <name>LIN_BGR</name>
          <description> register LIN_BGR </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXT" -->
            <field>
              <name>EXT</name>
              <description> bitfield EXT </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR1" -->
            <field>
              <name>BGR1</name>
              <description> bitfield BGR1 </description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR0" -->
            <field>
              <name>BGR0</name>
              <description> bitfield BGR0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FCR1" -->
        <register>
          <name>LIN_FCR1</name>
          <description> register LIN_FCR1 </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLSTE" -->
            <field>
              <name>FLSTE</name>
              <description> bitfield FLSTE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRIIE" -->
            <field>
              <name>FRIIE</name>
              <description> bitfield FRIIE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description> bitfield FDRQ </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description> bitfield FTIE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description> bitfield FSEL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FCR0" -->
        <register>
          <name>LIN_FCR0</name>
          <description> register LIN_FCR0 </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description> bitfield FLST </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description> bitfield FLD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description> bitfield FSET </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description> bitfield FCL2 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description> bitfield FCL1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description> bitfield FE2 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description> bitfield FE1 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FBYTE1" -->
        <register>
          <name>LIN_FBYTE1</name>
          <description> register LIN_FBYTE1 </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LIN_FBYTE2" -->
        <register>
          <name>LIN_FBYTE2</name>
          <description> register LIN_FBYTE2 </description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
